---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegmentArray.IsEmpty
source: html/ac1d226b-0119-086b-0c01-06ebe507760f.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.